import numpy as np

# ================== 系统参数定义 ==================
# Q = np.diag([0.1, 0.1, 0.1])       # 过程噪声协方差（平台状态）
# R = 0.1                            # 单个距离测量的噪声方差
num_tags = 4                       # Tag数量
num_anchors = 9                   # Anchor数量
# x0 = np.array([5.0, 2.0, 1.0])     # 初始状态 [t_x, t_y, theta]
# P0 = np.eye(3) * 0                 # 初始协方差
N = 102                          # 时间步数


# 定义Tag在平台坐标系中的位置（相对平台中心）
tags_relative = np.array([
    [0.0, 0.0],    # Tag 0
    [1.0, 0.0],     # Tag 1
    [0.0, 1.0],   # Tag 2
    [1.0, 1.0]     # Tag 3
])

anchors_global= np.array([
    [0, 0.0],    # A 0
    [0, 5.0],     # A 1
    [0, 10.0],   # A 2
    [5, 0.0],    # A 3
    [5, 5.0],     # A 4
    [5, 10.0],   # A 5
    [10, 0.0],   # A 6
    [10, 5.0],   # A 7
    [10, 10.0]   # A 8
])
